EDTconf/src/Catalogs/ЗаписиКалендаряСотрудника/ЗаписиКалендаряСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаписиКалендаряСотрудника</name>
  <attributes>
    <name>ETag</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>DefinedType.ИсточникЗаписейКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.КалендариСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Начало</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиИсточника</name>
    <comment>Для связи со строкой табличной части источника</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окончание</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеЗапрещено</name>
    <comment>Запрет интерактивного редактирования записи в планировщике</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDTconf/src/Catalogs/ЗаписиКалендаряСотрудника/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Окончание < Начало Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		НСтр("ru='Дата окончания не может быть меньше даты начала.';uk='Дата закінчення не може бути менше дати початку.'"),
		ЭтотОбъект,
		"Окончание",
		,
		Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ЗаполнитьКлючевыеПоля();
	
	ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	ОбменДанными.Получатели.Очистить();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДозаполнитьПоУмолчанию()
	
	Если ЗначениеЗаполнено(Календарь) Тогда
		Возврат;
	КонецЕсли;
	
	Календарь = ЗаполнениеОбъектовCRM.ПолучитьКалендарьСотрудника();
	
КонецПроцедуры

Процедура ЗаполнитьКлючевыеПоля()
	
	Если ПометкаУдаления Тогда
		ETag = "";
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Идентификатор) Тогда
	//	Ключ = ОбменСGoogle.КлючИзИдентификатора(Идентификатор, ТипЗнч(ЭтотОбъект));
	//	Возврат;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СсылкаНаОбъект = Ссылка;
	Иначе
		СсылкаНаОбъект = Справочники.ЗаписиКалендаряСотрудника.ПолучитьСсылку();
		УстановитьСсылкуНового(СсылкаНаОбъект);
	КонецЕсли;
	
	//Ключ = ОбменСGoogle.КлючИзИдентификатора(
	//СтрЗаменить(СсылкаНаОбъект.УникальныйИдентификатор(), "-", ""),
	//ТипЗнч(ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
